---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.FixedNumber
enum: Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern
source: html/a13c4016-99f3-fc97-51ef-0ec2d534295a.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetLayoutPattern.FixedNumber

The spacing between the rebars is adjustable,
 but the number of bars is constant based on input.